---
type: GenericZone
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 5
tags: [revit-api, class]
---

# GenericZone

`Autodesk.Revit.DB.Analysis.GenericZone` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2020.1 | `public static GenericZone Create ( Document doc , string name , GenericZoneDomainData domainData , ElementId levelId , IList < CurveLoop > curveLoops )` |
| Method | GetBoundaries | 2020.1 | `public IList < CurveLoop > GetBoundaries ()` |
| Method | GetDomainData | 2020.1 | `public GenericZoneDomainData GetDomainData ()` |
| Property | LevelOffset | 2021.1 | `public double LevelOffset { get ; set ; }` |
| Property | Parameter | — | `` |